
CORE_LEXICON: dict[str, str] = {
    "start":
        "<b>БОТ ДЛЯ ОТСЛЕЖИВАНИЯ ЗАДАЧ</b>"
        "\n\n Для создания задачи нажмите <u>CREATE</u>"
        "Для для просмотра задач нажмите <u>LIST</u>",
    "help":
        "<b>ЭТО БОТ ДЛЯ ОТСЛЕЖИВАНИЯ ЗАДАЧ.\n"
         "❓❓❓ ЧТО ОН УМЕЕТ ❓❓❓\n</b>"
         "\t1) Добавлять задачи\n"
         "\t2) Удалять задачи\n"
         "\t3) Выводить список задач\n"
         "\t<b>ДЛЯ НАЧАЛА РАБОТЫ С БОТОМ\n</b>"
         "\tВВЕДИТЕ КОМАНДУ\n"
         "\t\t /start",
}

